// Міша Клименко, [17.02.2023 20:33]
// 1) Написати функцію compact() яка має приймати на вхід масив, а на вихід має повертати значення нового масиву без повторень.
// приклад:
// const arr = [5, 3, 4, 5,6,7,3];
// const arr2 = compact(arr);
// console.log(arr2) ; // [5,3,4,6,7]

// Міша Клименко, [17.02.2023 20:45]
// 2) Написати функцію createArray(start, end), яка приймає на вхід 2 параметри:
//  - початкове значення
//  - кінцеве значення
// а на виході отримує масив із діапазоном цих значень (реалізувати достатньо лише із числовими значеннями)
// let arr = createArray(2, 9);
// console.log(arr); // [2,3,4,5,6,7,8,9]
// Міша Клименко, [17.02.2023 20:33]
// 1) Написати функцію compact() яка має приймати на вхід масив, а на вихід має повертати значення нового масиву без повторень.
// приклад:
// const arr = [5, 3, 4, 5,6,7,3];
// const arr2 = compact(arr);
// console.log(arr2) ; // [5,3,4,6,7]

// Міша Клименко, [17.02.2023 20:45]
// 2) Написати функцію createArray(start, end), яка приймає на вхід 2 параметри:
//  - початкове значення
//  - кінцеве значення
// а на виході отримує масив із діапазоном цих значень (реалізувати достатньо лише із числовими значеннями)
// let arr = createArray(2, 9);
// console.log(arr); // [2,3,4,5,6,7,8,9]

// Міша Клименко, [17.02.2023 20:58]
// 3) Створити функцію, яка використовує метод trim() для рядків. Дана функція має брати на вхід рядок із іменами, та сортувати їх по алфавіту, але між іменами може бути багато пробелів(функція має їх забирати)
// let names = "Alex,    Orysia, Misha,    Ira     , Paul";
// let newNames = sortNames(names);
// console.log(newNames); // 'Alex, Ira, Misha, Orysia, Paul'

// Міша Клименко, [17.02.2023 21:00]
// ідеально GitHub репа на курс, і кожна домашка окрема вітка, але можна і CodePen, якщо не получиться то тоді в п'ятницю обсудимо як будете скидати

// Міша Клименко, [17.02.2023 21:00]
// поки 3 завдання, ще декілька скину через вихідні

// Юрій Гончарук, [17.02.2023 21:01]
// кожен в свій репозиторій?

// Міша Клименко, [17.02.2023 21:01]
// я їх винесу додатково в табличку із записами, але і тут скидаю щоб бачили явно що при виконанні має бути

// Міша Клименко, [17.02.2023 21:01]
// так
